package domain

// KindType[C] — обобщённый тип, который представляет конкретный тип коннектора.
type KindType[C any] Kind

// KindGroup — идентификатор группы типов коннекторов
type KindGroup Kind

// Kind — интерфейс, который представляет тип коннектора.
type Kind interface {
	// ID возвращает неотрицательный идентификатор типа коннектора.
	// Значение ID всегда неотрицательное число и используется как быстрый индекс во внутренних структурах.
	// Внутренний код не проверяет знак ID, опираясь на этот контракт ради скорости.
	ID() int
	// String возвращает каноническое текстовое имя типа коннектора.
	// Возвращаемое значение:
	//   - string: имя типа коннектора в том виде, в котором оно было закреплено за этим kind.
	String() string
}
